Revit 2027 API
BuiltInFailures.SketchFailures.SketchedRunInvalidPath Property
 Invalid stair path. Stair path should connect both start and end riser, and cross all other risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchedRunInvalidPath { get; }
Public Shared ReadOnly Property SketchedRunInvalidPath As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchedRunInvalidPath {
	FailureDefinitionId^ get ();
}
static member SketchedRunInvalidPath : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace